УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f008b09-45f5-46c4-8328-e52829147381">
  <name>Проекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="24d508af-8d0e-4daf-a6d7-9b40c1eb36b3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7d468fba-e35f-4187-8bf3-1ad16042cd5c">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ef5bce5-04ec-4290-b75b-342df3e7a74d">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30f6b359-a769-437e-975f-fa4f2e92e3fd">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0edeaa09-7e78-498e-9c54-ce2f2a69f969">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4b58d5ae-eed2-4e62-a1be-0eba4ff92bcd">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff79f803-60df-471d-924b-b81d7553efb1">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17c62a5c-9d9e-4169-8fa7-26e1f27c5163">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4aa81cd-18f1-4902-9c1f-c902893806b3">
    <name>смартГенеральныйДиректор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="766ca5a6-8585-4744-82ef-ceeb65521cb2">
    <name>смартБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47683048-9c72-4bdd-96b5-bc2b6dcad26a">
    <name>смартОтветственныйЗаЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cfd754c-c822-4e79-b5ab-2ee7ff24fb99">
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a7affe-e81a-4e16-9597-b677a73ec63f">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d433a349-afcf-447e-ae95-310605a8cb7a">
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/Forms/смарт_ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", Справочники.Партнеры.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МассивКолонокНеИсключений = Новый Массив;
	МассивКолонокНеИсключений.Добавить("Направление");
	МассивКолонокНеИсключений.Добавить("ДатаНачала");
	МассивКолонокНеИсключений.Добавить("ДатаОкончания");
	
	Если МассивКолонокНеИсключений.Найти(Элементы.Список.ТекущийЭлемент.Имя) = Неопределено 
		И Элемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Партнер);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СсылкаПартнер = ?(ЗначениеЗаполнено(ТекущиеДанные.Партнер), ТекущиеДанные.Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", СсылкаПартнер);	
		Элементы.Заметки.Обновить();	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка КАК Проект,
	|	ПроектыПартнерыИКонтактныеЛица.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_Партнеры
	|ИЗ
	|	Справочник.Проекты.ПартнерыИКонтактныеЛица КАК ПроектыПартнерыИКонтактныеЛица
	|ГДЕ
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка В(&Проекты)
	|	И ПроектыПартнерыИКонтактныеЛица.НомерСтроки = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИНН,
	|	ВТ_Партнеры.Проект КАК Проект
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Партнеры.Партнер = Контрагенты.Партнер
	|ИТОГИ ПО
	|	Проект";
	
	Запрос.УстановитьПараметр("Проекты", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПроект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПроект.Следующий() Цикл
		
		СтрокаИНН = "";
	
		Выборка = ВыборкаПроект.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ИНН) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаИНН = СтрокаИНН + ?(ЗначениеЗаполнено(СтрокаИНН), ", ", "") + Выборка.ИНН;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаИНН) Тогда
			СтрокаСписка = Строки[ВыборкаПроект.Проект];
			СтрокаСписка.Данные.ИНН = СтрокаИНН;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаметку(Команда)
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Предмет", Элементы.Список.ТекущиеДанные.Партнер), ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеСозданияНовойЗаметки",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияНовойЗаметки(Результат, ДопПараметры)Экспорт
	Элементы.Заметки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);

КонецПроцедуры
